In [48]:
import pandas as pd

In [49]:
train = pd.read_csv('http://bit.ly/kaggletrain')

In [50]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
# 
# How many people survived  -- 342 
# How many were males and females who survived

In [52]:
train.shape[0]

891

In [53]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [58]:
train['sex_dummy'] = train.Sex.map({'female':1, 'male':0})

In [59]:
train.columns

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked',
       u'sex_dummy'],
      dtype='object')

In [65]:
# How many people survived
total_survived = train.loc[train.Survived==1, :]['Survived'].count()
total_survived

342

In [66]:
female_surviovors = train.loc[(train.Survived==1) & (train.sex_dummy==1), :]['Survived'].count()
female_surviovors

233

In [68]:
male_survivors = total_survived - female_surviovors
male_survivors

109

# Female survivors are more than male survivors

In [33]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [27]:
# How many people died 
total_died = train.shape[0]- train.loc[train.Survived==1, :]['Survived'].count()
total_died

549

In [14]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [44]:
train['sex_dummy'] = train.Sex.map({'female':1, 'male':0})

In [46]:
train.loc[0:4, ['Sex', 'sex_dummy']]

      Sex  sex_dummy
0    male          0
1  female          1
2  female          1
3  female          1
4    male          0

In [77]:
train.Age.isnull().sum()

177

In [111]:
string_1 = 'hello_saloni'
concat_string=[]
strings = string_1.split("_")
for string in strings: 
    first_char = string[0].upper()
    concat_string.append(first_char + string[1:])
    
"_".join(concat_string)

'Hello_Saloni'

In [112]:
convert('hello_saloni')

NameError: name 'convert' is not defined

In [ ]:
string_1 = 'hello'
vowel = ['a', 'e', 'i', 'o', 'u']

/

In [115]:
given_string = ['a', 'e']
for char in given_string: 
    print char.islower()

True
True

In [124]:
given_String = [1, 2, 4, 'a', 'e']
for char in given_string: 
    print char.isnumeric()

AttributeError: 'str' object has no attribute 'isnumeric'